package L04;


import java.util.*;

public class MAIN {


    public static void main(String[] args) {

        //Задание 1
        MakeAList list=new MakeAList();
        String[]strArr={"щенок", "транспорт", "щенок","форвард", "рукав", "привал", "целы", "варенье", "ёлка",
                "войлок", "цедра", "винт", "кишлак", "магазин", "якорь", "финик", "см.",
                "чеснок", "тип", "кишлак", "полено", "жрец", "роща", "жрец", "жрец",
                "цедра", "жрец", "цыган", "щепка", "щенок", "кто-нибудь", "мировоззрение",
                "цаца", "цыган", "цедра", "роща", "цедра",
                "цыган", "роща", "шла", "рама", "дача", "пирог", "яды",
                "ловкий", "пуговица", "роща", "щенок", "щепка", "жрец",
                "фураж", "счеты", "парашют", "роща", "бдительность", "ковер", "ультразвук", "цедра",
                "укрощен", "роща", "роща", "щепка", "йод", "толь", "низший", "проказы",
                "лопух", "мода", "яды", "зорька"
        };

        //Создаем список из масивов слов, считаем количесво повторов
        ArrayList<String>strList=list.getList(strArr);
        //Создаем список слов без повторов
        HashSet<String>strSet=list.getSetList(strList);
        //Выводим список слов без повторов с указанием количесвта повторов
        HashMap<String,Integer>strMap=list.getDuplicateList(strList,strSet);


        // Задание 2

        System.out.println("\n\nЗадание II\n\n");
        String[]accArr={"+814(318)334-99-65176 Анютина Юлия"
                , "+18(2872)922-67-20835 Михайлова Светлана",
                "+324(7488)731-33-57652 Чечет Владимир",
                "+78(2957)844-44-39049 Михайлова Светлана",
                "+350(5884)847-57-35081 Ветров Сергей",
                "+57(173)238-21-68125 Ветров Сергей",
                "+608(7426)225-51-94164 Левошич Наталия",
                "+793(1297)166-79-01796 Михайлова Светлана",
                "+84(5900)714-70-61789 Анютина Юлия",
                "+282(4291)378-02-03936 Пересыпкина Анна"
        };

        //Создаем справочник
        YellowPages book=new YellowPages();
        //Загружаем список абонентов
        ArrayList<String>strList1=list.getList(accArr);
        //Сортируем абонентов Номер - Имя
        HashMap<String,String>strMap1=book.getBook(strList1);
        //Выводим номера по имени абонента
        book.getNumberByName("Михайлова Светлана",strMap1);






        /*
        String str=" щенок транспорт форвард рукав привал целы варенье ёлка войлок \n" +
                "цедра щенок винт кишлак магазин якорь финик см. чеснок тип кишлак полено \n" +
                "жрец роща жрец жрец цедра жрец цыган щепка щенок кто-нибудь мировоззрение \n" +
                "цаца цыган цедра роща цедра цыган роща шла рама дача пирог яды ловкий пуговица \n" +
                "роща щенок щепка жрец фураж счеты парашют роща бдительность ковер ультразвук \n" +
                "цедра укрощен роща роща щепка йод толь низший проказы лопух мода яды зорька \n";
        String str1=str.replace(" ", "\", \"");

        System.out.println(str1);
         */
        /*
        String str="+814(318)334-99-65176 Анютина Юлия\n" +
                "+18(2872)922-67-20835 Шадрин Виктор\n" +
                "+324(7488)731-33-57652 Чечет Владимир\n" +
                "+78(2957)844-44-39049 Михайлова Светлана\n" +
                "+350(5884)847-57-35081 Ветров Сергей\n" +
                "+57(173)238-21-68125 Довгаль Ирина\n" +
                "+608(7426)225-51-94164 Левошич Наталия\n" +
                "+793(1297)166-79-01796 Михайлова Светлана\n" +
                "+84(5900)714-70-61789 Левошич Наталия\n" +
                "+282(4291)378-02-03936 Пересыпкина Анна\n";
        String str1=str.replace("\n", "\", \"");

        System.out.println(str1);

         */

    }
}
